posts/algorithm/algorithm-weekly-remove-nth-node-from-end-of-list/index.org
*** Approach 2 Two pass algorithm
这个解法是在leetcode的solution解析中看到的，解法的意图是将问题转化为删去正数第 =l-n+1= 个节点。其中 =l= 为链表的长度，这个是容易获得的。

下面是我按照这种思想使用C++进行编写的解法：
#+BEGIN_SRC cpp
ListNode* removeNthFromEnd(ListNode* head, int n) {
    // 第一次遍历，得到链表长度
    int len = 0;
    ListNode* p1 = head;
    while (p1) {
        p1 = p1->next;
        ++len;
    }

    // 删除正数第1个节点
    if (n == len) {
        ListNode* p = head->next;
        delete head;
        return p;
    }

    // 需要找到第 len - n 个节点（删除节点的前一个节点）
    ListNode* p2 = head;
    for (int i=0; i<len-n-1; ++i) {
        p2 = p2->next;
    }
    ListNode* p3 = p2->next;
    p2->next = p3->next;
    delete p3;
    p3 = nullptr;

    return head;
}
#+END_SRC
我在完成这个解法时，发现在删去正数第 =l-n+1= 个节点时，需要找到的实际上是正数第 =l-n= 个节点。这样，如果要删去正数第1个节点时，就需要对这个边界条件进行特殊处理。

使用一个 =dummy= 节点，将头节点包裹起来，就解决了之前的边界问题。 *在遇到边界条件时，尝试将边界包裹起来，这样边界就转换为非边界了。* 下面的实现代码截取自leetcode，使用java编写。

#+BEGIN_SRC java
public ListNode removeNthFromEnd(ListNode head, int n) {
    ListNode dummy = new ListNode(0);
    dummy.next = head;
    int length  = 0;
    ListNode first = head;
    while (first != null) {
        length++;
        first = first.next;
    }
    length -= n;
    first = dummy;
    while (length > 0) {
        length--;
        first = first.next;
    }
    first.next = first.next.next;
    return dummy.next;
}
#+END_SRC

这种算法的时间复杂为 =O(l)= ，第一次遍历求链表长度，第二次遍历找第 =l-n= 个节点，一共有 =2L-n= 次操作。空间复杂度为 =O(1)= ，没有使用额外的空间。


